LEXICON_RU: dict[str, str] = {'/start': 'Привет! Это бот для создания своей анкеты.\nЧтобы перейти к созданию своей анкеты,'
                                        'выбери /profile\n\n'
                                        'Помощь в работе бота - /help',
                              '/help': 'Ты че даун? Какая тебе помощь в заполнении анкеты?',
                              '/cancel': 'Чтобы заполнить анкеты заново - введите /profile',
                              'имя': 'Введите ваше имя:',
                              'не имя': 'Введите корректное имя. Имя может содержать только буквы.',
                              'возраст': 'Введите ваш возраст:',
                              'мужской': 'Мужчина',
                              'женский': 'Женщина',
                              'Европа': 'Я из Европы',
                              'пол': 'Выберите ваш пол:',
                              'не возраст': 'Введите корректное значение. Возраст должен содержать только цифры'
                                            'и должны быть в диапазоне от 18 до 100 лет (включительно)',
                              'фото': 'Загрузите ваше фото',
                              'не пол': 'Выберите ваш пол из предложенных вариантов.',
                              'город': 'Введите ваш город:',
                              'не фото': 'Это не фото или я его не распознал. Попробуйте еще раз или загрузите другое фото',
                              'о себе': 'Расскажите о себе:',
                              'не город': 'Введите корректно город. Город может содержать только буквы',
                              'анкета готова': 'Ваша анкета готова. Чтобы ее посмотреть - выберите /getprofile',
                              'не о себе': 'Введите только текст в раздел о себе',
                              'нет анкеты': 'У вас еще нет анкеты. Чтобы заполнить - введите /profile',
                              'редактировать': 'Редактировать анкету - /editProfile',
                              'ред имя': 'Изменить имя',
                              'ред возраст': 'Изменить возраст',
                              'ред город': 'Изменить город',
                              'ред о себе': 'Изменить информацию о себе',
                              'ред фото': 'Загрузить новое фото',
                              'изменение': 'Анкета обновлена. Посмотреть - /getprofile',
                              'Есть анкета': 'У вас уже есть анкета. Чтобы редактировать - выберите /editProfile',
                              'no_echo': 'Я не понимаю вас. Если нужна помощь - выберите /help'}

LEXICON_START_MENU_RU: dict[str, str] = {'/help': 'Помощь в работе бота',
                                         '/start': 'Начать'}

LEXICON_FILLING_OUT_THE_FORM: dict[str, str] = {'/cancel': 'Прекратить заполнение анкеты'}